halfoffive/smart-flower-pot/esp32/smart_flower_pot/smart_flower_pot.ino
/*
 * 智能花盆 — ESP32 系列通用固件
 * 支持：ESP32 / ESP32-C3 / ESP32-C6 / ESP32-S2 / ESP32-S3
 * 功能：土壤湿度检测 + DHT11 温湿度 + 水泵自动灌溉 + BLE 远程设置（S2 除外）
 * 引脚：根据芯片型号自动适配，详见下方引脚定义
 */

/* ===================== 芯片适配（引脚定义） ===================== */
#if defined(CONFIG_IDF_TARGET_ESP32C6)
  #define SOIL_ADC_PIN 0   // ADC1_CH0
  #define DHT_PIN 4
  #define PUMP_POS_PIN 5   // H桥方向A
  #define PUMP_NEG_PIN 6   // H桥方向B
  #define PUMP_PWM_PIN 7   // PWM 调速
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
  #define SOIL_ADC_PIN 0   // ADC1_CH0
  #define DHT_PIN 3
  #define PUMP_POS_PIN 5
  #define PUMP_NEG_PIN 6
  #define PUMP_PWM_PIN 7
#elif defined(CONFIG_IDF_TARGET_ESP32S2)
  #define SOIL_ADC_PIN 1   // ADC1_CH0
  #define DHT_PIN 3
  #define PUMP_POS_PIN 5
  #define PUMP_NEG_PIN 6
  #define PUMP_PWM_PIN 7
  #define NO_BLE 1         // ESP32-S2 不支持 BLE
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
  #define SOIL_ADC_PIN 1   // ADC1_CH0
  #define DHT_PIN 4
  #define PUMP_POS_PIN 5
  #define PUMP_NEG_PIN 6
  #define PUMP_PWM_PIN 7
#elif defined(CONFIG_IDF_TARGET_ESP32)
  #define SOIL_ADC_PIN 36  // ADC1_CH0 (VP, 仅输入)
  #define DHT_PIN 14
  #define PUMP_POS_PIN 25
  #define PUMP_NEG_PIN 26
  #define PUMP_PWM_PIN 27
#else
  #error "不支持的 ESP32 变体。支持：ESP32, ESP32-C3, ESP32-C6, ESP32-S2, ESP32-S3"
#endif

#define DHT_TYPE DHT11

#ifndef NO_BLE
  #include <BLEDevice.h>
  #include <BLEServer.h>
  #include <BLEUtils.h>
#endif

#include <Preferences.h>
#include <DHT.h>

/* ===================== PWM 配置 ===================== */
#define PWM_FREQ 5000     // PWM 频率 5kHz
#define PWM_RESOLUTION 8  // 8位分辨率（0-255）
// PWM_CHANNEL 在 Arduino-ESP32 3.x 中已废弃，通过引脚直接控制

/* ===================== 定时参数 ===================== */
#define IDLE_INTERVAL_MS 2000       // 空闲态检测周期 2秒
#define WATERING_INTERVAL_MS 200    // 灌溉态检测周期 200毫秒
#define BLE_NOTIFY_INTERVAL_MS 500  // BLE 通知推送周期 0.5秒
#define MAX_WATERING_MS 5000        // 最长灌溉时间 5秒

/* ===================== BLE UUID ===================== */
#define SERVICE_UUID "12345678-1234-1234-1234-123456789abc"
#define SETTINGS_CHAR_UUID "12345678-1234-1234-1234-123456789abd"
#define SENSOR_CHAR_UUID "12345678-1234-1234-1234-123456789abe"
#define DEVICE_INFO_UUID "12345678-1234-1234-1234-123456789abf"

/* ===================== 设置默认值 ===================== */
#define DEFAULT_TEMP_MIN 150    // 15.0°C
#define DEFAULT_TEMP_MAX 350    // 35.0°C
#define DEFAULT_HUM_MIN 30      // 30%
#define DEFAULT_HUM_MAX 80      // 80%
#define DEFAULT_SOIL_THR 2000   // ADC 阈值
#define DEFAULT_COMPARE_MODE 0  // 0=低于启动
#define DEFAULT_PUMP_SPEED 128  // PWM 50%
#define DEFAULT_WATER_DIR 0     // 0=正转

/* ===================== NVS 键名 ===================== */
#define NVS_NS "flowerpot"
#define KEY_TEMP_MIN "tempMin"
#define KEY_TEMP_MAX "tempMax"
#define KEY_HUM_MIN "humMin"
#define KEY_HUM_MAX "humMax"
#define KEY_SOIL_THR "soilThr"
#define KEY_CMP_MODE "cmpMode"
#define KEY_PUMP_SPEED "pumpSpd"
#define KEY_WATER_DIR "watDir"

/* ===================== 枚举定义 ===================== */
enum PumpState : uint8_t {
  PUMP_OFF = 0,      // 水泵停止
  PUMP_FORWARD = 1,  // 正转浇水
  PUMP_REVERSE = 2   // 反转浇水
};

enum SystemState : uint8_t {
  STATE_IDLE,     // 空闲态：长周期检测，水泵停止
  STATE_WATERING  // 灌溉态：高频检测，水泵运行
};

enum CompareMode : uint8_t {
  MODE_BELOW = 0,  // 低于阈值时启动灌溉
  MODE_ABOVE = 1   // 高于阈值时启动灌溉
};

/* 浇水方向特殊值：0xFF = 仅保存设置，不触发水泵 */
#define WATER_DIR_SAVE_ONLY 0xFF

/* ===================== 全局对象与变量 ===================== */
DHT dht(DHT_PIN, DHT_TYPE);  // DHT11 温湿度传感器
Preferences prefs;           // NVS 闪存存储

#ifndef NO_BLE
// ── BLE 特征指针 ──
BLECharacteristic *pSettingsChar = nullptr;    // 设置特征（可读写）
BLECharacteristic *pSensorChar = nullptr;      // 传感器特征（可读+通知）
BLECharacteristic *pDeviceInfoChar = nullptr;  // 设备信息特征（只读）

// ── 连接状态 ──
bool deviceConnected = false;     // 当前是否有 BLE 客户端连接
bool oldDeviceConnected = false;  // 上一轮连接状态（用于检测变化）
#endif

// ── 系统状态 ──
SystemState systemState = STATE_IDLE;  // 当前系统状态
PumpState pumpState = PUMP_OFF;        // 当前水泵状态
bool manualOverride = false;           // 手动控制模式（来自网页测试页）
unsigned long lastReadTime = 0;        // 上次读取传感器的时间戳
unsigned long lastBleNotifyTime = 0;   // 上次 BLE 通知推送的时间戳
unsigned long wateringStartTime = 0;   // 本次灌溉开始时间戳

// ── 用户可调设置 ──
uint16_t tempMin = DEFAULT_TEMP_MIN;         // 温度下限（×10）
uint16_t tempMax = DEFAULT_TEMP_MAX;         // 温度上限（×10）
uint8_t humMin = DEFAULT_HUM_MIN;            // 湿度下限（%）
uint8_t humMax = DEFAULT_HUM_MAX;            // 湿度上限（%）
uint16_t soilThreshold = DEFAULT_SOIL_THR;   // 土壤湿度 ADC 阈值
uint8_t compareMode = DEFAULT_COMPARE_MODE;  // 比较模式
uint8_t pumpSpeed = DEFAULT_PUMP_SPEED;      // 水泵 PWM 转速
uint8_t waterDirection = DEFAULT_WATER_DIR;  // 浇水方向

// ── 当前传感器读数 ──
uint16_t currentSoil = 0;  // 土壤湿度 ADC 值
uint16_t currentTemp = 0;  // 温度（×10）
uint8_t currentHum = 0;    // 空气湿度（%）

/* ===================== 串口帧协议常量 ===================== */
#define SERIAL_FRAME_HEAD1 0xAA
#define SERIAL_FRAME_HEAD2 0x55
#define SERIAL_TYPE_SENSOR 0x01
#define SERIAL_TYPE_SETTINGS 0x02
#define SERIAL_TYPE_DEVICE_INFO 0x03
#define SERIAL_TYPE_READ_SETTINGS 0x04

/* ===================== 函数声明 ===================== */
// ── 设置管理 ──
void loadSettings();                        // 从 NVS 加载设置
void saveSettings();                        // 保存设置到 NVS
void serializeSettings(uint8_t *buffer);    // 设置编码为 11 字节
void deserializeSettings(uint8_t *buffer);  // 从 11 字节解码设置
void serializeSensorData(uint8_t *buffer);  // 传感器数据编码为 6 字节

// ── 传感器 ──
void readSensors();      // 读取所有传感器
void printSensorData();  // 串口打印传感器数据

// ── 水泵控制 ──
void startPump(PumpState direction);  // 启动水泵（指定方向）
void stopPump();                      // 停止水泵

// ── 灌溉决策 ──
bool shouldStartWatering();  // 是否满足灌溉启动条件
bool shouldStopWatering();   // 是否满足灌溉停止条件
void checkWatering();        // 灌溉状态机

// ── 串口通信 ──
void handleSerialCommand();                                      // 处理串口命令
void sendSerialFrame(uint8_t type, uint8_t *data, uint8_t len);  // 发送串口帧
void sendSensorDataSerial();                                     // 通过串口发送传感器数据
void sendSettingsSerial();                                       // 通过串口发送设置数据
void sendDeviceInfoSerial();                                     // 通过串口发送设备信息
uint8_t calcXOR(uint8_t *data, uint8_t len);                     // 计算 XOR 校验

/* ===================== BLE 回调类实现 ===================== */
#ifndef NO_BLE

// 设置特征回调：处理网页端的读写请求
class SettingsCallbacks : public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *pCharacteristic) override {
    uint8_t *data = pCharacteristic->getData();
    size_t len = pCharacteristic->getValue().length();

    Serial.println("[BLE] 收到设置写入请求");
    Serial.printf("[BLE] 数据长度: %d 字节\n", len);

    if (len == 11) {
      uint8_t newSpeed = data[9];  // 新的水泵转速
      uint8_t newDir = data[10];   // 新的浇水方向

      // 保存旧值，用于水泵控制决策
      uint8_t prevPumpSpeed = pumpSpeed;
      uint8_t prevWaterDir = waterDirection;

      deserializeSettings(data);

      // ── "仅保存设置"模式（向后兼容旧版 Web 端） ──
      // waterDirection = 0xFF 表示旧版网页端仅保存其他设置，不改变方向也不触发水泵
      // 恢复旧方向值，防止 0xFF 被写入 NVS 导致自动灌溉始终反转
      if (newDir == WATER_DIR_SAVE_ONLY) {
        waterDirection = prevWaterDir;
      }

      saveSettings();  // 立即持久化到 NVS

      // ── 水泵控制逻辑（解耦：方向保存与水泵触发分离） ──
      // 新版 Web 端发送实际方向值（0 或 1），不再使用 0xFF 标志
      // 水泵仅在速度从 0 变为非 0 时启动，避免保存设置时误触发水泵
      if (newDir == WATER_DIR_SAVE_ONLY) {
        // 旧版兼容：仅保存设置，不触发水泵
        Serial.println("[设置] ✓ 仅保存设置（不触发水泵）");
      }
      // 速度从 0 变为非 0：启动水泵（手动模式）
      else if (newSpeed > 0 && prevPumpSpeed == 0 && systemState == STATE_IDLE && !shouldStartWatering()) {
        manualOverride = true;
        Serial.println("[手动控制] ▶ 网页端启动水泵（手动模式）");
        startPump(newDir == 0 ? PUMP_FORWARD : PUMP_REVERSE);
      }
      // 速度从非 0 变为 0：停止水泵（退出手动模式）
      else if (newSpeed == 0 && prevPumpSpeed > 0 && manualOverride) {
        manualOverride = false;
        stopPump();
        Serial.println("[手动控制] ■ 网页端停止水泵，退出手动模式");
      }
      // 手动模式中方向变更：重启水泵
      else if (manualOverride && newDir != prevWaterDir && newSpeed > 0) {
        Serial.println("[手动控制] ↻ 方向变更，重启水泵");
        startPump(newDir == 0 ? PUMP_FORWARD : PUMP_REVERSE);
      }
      // 自动灌溉中收到设置变更：仅更新转速（PWM 实时生效）
      else if (systemState == STATE_WATERING && pumpState != PUMP_OFF) {
        ledcWrite(PUMP_PWM_PIN, pumpSpeed);
        Serial.printf("[自动灌溉] 转速已更新为 %d / 255\n", pumpSpeed);
      }

      Serial.println("[BLE] 设置已更新并保存到闪存");
    } else {
      Serial.printf("[BLE] ⚠ 设置数据长度异常: 期望 11 字节, 实际 %d 字节\n", len);
    }
  }

  void onRead(BLECharacteristic *pCharacteristic) override {
    uint8_t buffer[11];
    serializeSettings(buffer);
    pCharacteristic->setValue(buffer, 11);
    Serial.println("[BLE] 设置已被客户端读取");
  }
};

