halfoffive/smart-flower-pot/esp32/smart_flower_pot/smart_flower_pot.ino
                  // "仅保存设置"模式（向后兼容）：恢复旧方向值，防止 0xFF 写入 NVS
                  if (newDir == WATER_DIR_SAVE_ONLY) {
                    waterDirection = prevWaterDir;
                  }

                  saveSettings();

                  // ── 水泵控制逻辑（解耦：方向保存与水泵触发分离） ──
                  if (newDir == WATER_DIR_SAVE_ONLY) {
                    Serial.println("[Serial] ✓ 仅保存设置（不触发水泵）");
                  }
                  // 速度从 0 变为非 0：启动水泵（手动模式）
                  else if (newSpeed > 0 && prevPumpSpeed == 0 && systemState == STATE_IDLE && !shouldStartWatering()) {
                    manualOverride = true;
                    Serial.println("[Serial 手动控制] ▶ 启动水泵（手动模式）");
                    startPump(newDir == 0 ? PUMP_FORWARD : PUMP_REVERSE);
                  }
                  // 速度从非 0 变为 0：停止水泵（退出手动模式）
                  else if (newSpeed == 0 && prevPumpSpeed > 0 && manualOverride) {
                    manualOverride = false;
                    stopPump();
                    Serial.println("[Serial 手动控制] ■ 停止水泵，退出手动模式");
                  }
                  // 手动模式中方向变更：重启水泵
                  else if (manualOverride && newDir != prevWaterDir && newSpeed > 0) {
                    Serial.println("[Serial 手动控制] ↻ 方向变更，重启水泵");
                    startPump(newDir == 0 ? PUMP_FORWARD : PUMP_REVERSE);
                  }
                  // 自动灌溉中：仅更新转速（PWM 实时生效）
                  else if (systemState == STATE_WATERING && pumpState != PUMP_OFF) {
                    ledcWrite(PUMP_PWM_PIN, pumpSpeed);
                    Serial.printf("[Serial 自动灌溉] 转速已更新为 %d / 255\n", pumpSpeed);
                  }

                  Serial.println("[Serial] 设置已更新并保存到闪存");
                }
                break;
              }

            case SERIAL_TYPE_READ_SETTINGS:
              {
                // 收到读取设置请求
                Serial.println("[Serial] 收到读取设置请求");
                sendSettingsSerial();
                break;
              }

            case SERIAL_TYPE_DEVICE_INFO:
              {
                // 收到读取设备信息请求
                Serial.println("[Serial] 收到读取设备信息请求");
                sendDeviceInfoSerial();
                break;
              }

            default:
              Serial.printf("[Serial] 未知帧类型: 0x%02X\n", type);
              break;
          }
        } else {
          Serial.println("[Serial] 帧校验失败，丢弃");
        }

        rxIndex = 0;  // 重置缓冲区
      }
    }

    // 防止缓冲区溢出
    if (rxIndex >= sizeof(rxBuffer)) {
      rxIndex = 0;
    }
  }
}

/* ===================== 水泵控制 ===================== */

// 启动水泵，指定旋转方向
void startPump(PumpState direction) {
  // 如果水泵已在运行，先停止再切换方向（保护 H桥）
  if (pumpState != PUMP_OFF) {
    stopPump();
    delay(50);  // 短暂延时，防止 H桥上下桥臂直通
  }

  pumpState = direction;

  if (direction == PUMP_FORWARD) {
    digitalWrite(PUMP_POS_PIN, HIGH);
    digitalWrite(PUMP_NEG_PIN, LOW);
    Serial.println("[水泵] ▶ 正转启动");
  } else if (direction == PUMP_REVERSE) {
    digitalWrite(PUMP_POS_PIN, LOW);
    digitalWrite(PUMP_NEG_PIN, HIGH);
    Serial.println("[水泵] ▶ 反转启动");
  }

  ledcWrite(PUMP_PWM_PIN, pumpSpeed);
  Serial.printf("[水泵]   PWM 占空比: %d / 255\n", pumpSpeed);
}

// 停止水泵
void stopPump() {
  ledcWrite(PUMP_PWM_PIN, 0);
  digitalWrite(PUMP_POS_PIN, LOW);
  digitalWrite(PUMP_NEG_PIN, LOW);
  pumpState = PUMP_OFF;
  Serial.println("[水泵] ■ 已停止");
}

/* ===================== 灌溉决策逻辑（纯函数式） ===================== */

// 判断是否应该启动灌溉
// 三个条件全部满足时返回 true
bool shouldStartWatering() {
  // 条件 1：土壤湿度满足启动条件
  bool soilCondition;
  if (compareMode == MODE_BELOW) {
    soilCondition = (currentSoil < soilThreshold);  // 低于阈值 → 缺水
  } else {
    soilCondition = (currentSoil > soilThreshold);  // 高于阈值 → 过湿
  }

  // 条件 2：温度在允许区间内
  bool tempInRange = (currentTemp >= tempMin && currentTemp <= tempMax);

  // 条件 3：空气湿度在允许区间内
  bool humInRange = (currentHum >= humMin && currentHum <= humMax);

  return soilCondition && tempInRange && humInRange;
}

// 判断是否应该停止灌溉
// 任一条件触发即返回 true
bool shouldStopWatering() {
  // 条件 1：土壤湿度已达到目标
  bool soilReached;
  if (compareMode == MODE_BELOW) {
    soilReached = (currentSoil >= soilThreshold);  // 高于阈值 → 水已够
  } else {
    soilReached = (currentSoil <= soilThreshold);  // 低于阈值 → 已排干
  }

  // 条件 2：温度超出允许区间
  bool tempOutOfRange = (currentTemp < tempMin || currentTemp > tempMax);

  // 条件 3：空气湿度超出允许区间
  bool humOutOfRange = (currentHum < humMin || currentHum > humMax);

  return soilReached || tempOutOfRange || humOutOfRange;
}

// 灌溉状态机：由定时器触发，根据当前状态执行相应逻辑
void checkWatering() {
  switch (systemState) {

    case STATE_IDLE:
      {
        // 空闲态 → 检查是否应该启动灌溉
        if (shouldStartWatering()) {
          systemState = STATE_WATERING;
          wateringStartTime = millis();

          Serial.println("═══════════════════════════════════");
          Serial.println("[系统] ▶ 进入灌溉状态");
          Serial.printf("  土壤 ADC=%d (阈值=%d, 模式=%s)\n",
                        currentSoil, soilThreshold,
                        compareMode == MODE_BELOW ? "低于启动" : "高于启动");
          Serial.printf("  温度=%.1f°C (区间 %.1f ~ %.1f)\n",
                        currentTemp / 10.0, tempMin / 10.0, tempMax / 10.0);
          Serial.printf("  湿度=%d%% (区间 %d ~ %d)\n",
                        currentHum, humMin, humMax);
          Serial.println("═══════════════════════════════════");

          // 按设定的方向启动水泵
          startPump(waterDirection == 0 ? PUMP_FORWARD : PUMP_REVERSE);
        }
        break;
      }

    case STATE_WATERING:
      {
        // 安全超时检查：防止传感器故障导致无限浇水
        if (millis() - wateringStartTime > MAX_WATERING_MS) {
          Serial.println("[系统] ⚠ 灌溉超时（5秒），强制停止！");
          stopPump();
          systemState = STATE_IDLE;
          break;
        }

        // 检查是否需要停止灌溉
        if (shouldStopWatering()) {
          Serial.println("═══════════════════════════════════");
          Serial.println("[系统] ◀ 退出灌溉状态");

          if (compareMode == MODE_BELOW) {
            Serial.printf("  土壤 ADC=%d 已达到阈值 %d\n", currentSoil, soilThreshold);
          } else {
            Serial.printf("  土壤 ADC=%d 已降至阈值 %d\n", currentSoil, soilThreshold);
          }
          Serial.println("═══════════════════════════════════");

          stopPump();
          systemState = STATE_IDLE;
        }
        break;
      }
  }
}

/* ===================== 初始化 setup() ===================== */

void setup() {
  // ── 串口初始化 ──
  Serial.begin(115200);
  delay(1000);  // 等待串口稳定
  Serial.println("\n");
  Serial.println("╔══════════════════════════════════════╗");
  Serial.println("║       智能花盆 ESP32 通用固件        ║");
  Serial.print("║       芯片: ");
  Serial.print(ESP.getChipModel());
  Serial.println("                ║");
  Serial.println("║       版本: 4.3.0                    ║");
  Serial.println("╚══════════════════════════════════════╝");
  Serial.println();

  // ── GPIO 初始化 ──
  pinMode(PUMP_POS_PIN, OUTPUT);
  pinMode(PUMP_NEG_PIN, OUTPUT);
  digitalWrite(PUMP_POS_PIN, LOW);
  digitalWrite(PUMP_NEG_PIN, LOW);
  Serial.println("[初始化] GPIO 已就绪");

  // ── PWM 初始化（Arduino-ESP32 3.x API: pin直接关联） ──
  ledcAttach(PUMP_PWM_PIN, PWM_FREQ, PWM_RESOLUTION);
  ledcWrite(PUMP_PWM_PIN, 0);
  Serial.printf("[初始化] PWM 已就绪 (频率=%dHz, 分辨率=%d位)\n", PWM_FREQ, PWM_RESOLUTION);

