halfoffive/smart-flower-pot/esp32/smart_flower_pot/smart_flower_pot.ino
  // ── DHT11 初始化 ──
  dht.begin();
  Serial.println("[初始化] DHT11 传感器已就绪");

  // ── 从 NVS 闪存加载设置 ──
  loadSettings();

#ifndef NO_BLE
  // ── BLE 初始化 ──
  BLEDevice::init("智能花盆");

  BLEServer *pServer = BLEDevice::createServer();
  pServer->setCallbacks(new ServerCallbacks());

  BLEService *pService = pServer->createService(SERVICE_UUID);

  // 设置特征（可读可写）
  pSettingsChar = pService->createCharacteristic(
    SETTINGS_CHAR_UUID,
    BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_WRITE);
  pSettingsChar->setCallbacks(new SettingsCallbacks());
  uint8_t initSettings[11];
  serializeSettings(initSettings);
  pSettingsChar->setValue(initSettings, 11);

  // 传感器数据特征（可读 + 通知）
  pSensorChar = pService->createCharacteristic(
    SENSOR_CHAR_UUID,
    BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_NOTIFY);
  uint8_t initSensor[6] = { 0 };
  pSensorChar->setValue(initSensor, 6);

  // 设备信息特征（只读）— JSON 格式，包含 MAC、芯片型号等
  pDeviceInfoChar = pService->createCharacteristic(
    DEVICE_INFO_UUID,
    BLECharacteristic::PROPERTY_READ);
  {
    String info = buildDeviceInfoJson();
    pDeviceInfoChar->setValue(info.c_str());
  }

  // 启动服务
  pService->start();

  // 开始 BLE 广播
  BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();
  pAdvertising->addServiceUUID(SERVICE_UUID);
  pAdvertising->setScanResponse(true);
  pAdvertising->setMinPreferred(0x06);  // 最小连接间隔 ~7.5ms
  pAdvertising->setMinPreferred(0x12);  // 最大连接间隔 ~22.5ms
  BLEDevice::startAdvertising();

  Serial.println("[BLE] 广播已开启，等待客户端连接...");
#else
  Serial.println("[BLE] ESP32-S2 不支持 BLE，仅使用串口通信");
#endif

  // 首次读取传感器，作为基线
  readSensors();
  lastReadTime = millis();

  // ── 发送就绪信号（串口帧），通知客户端固件已启动 ──
  sendDeviceInfoSerial();
  Serial.flush();
  Serial.println("[系统] 固件已就绪，串口通信已启动");
}

/* ===================== 主循环 loop() ===================== */

void loop() {
  unsigned long now = millis();

  // ── 处理串口命令（每次循环都检查，确保低延迟响应） ──
  handleSerialCommand();

#ifndef NO_BLE
  // ── 处理 BLE 连接/断开状态变化 ──
  if (deviceConnected && !oldDeviceConnected) {
    oldDeviceConnected = deviceConnected;
    Serial.println("[BLE] ✓ 客户端连接事件");
    readSensors();
    uint8_t sensorBuffer[6];
    serializeSensorData(sensorBuffer);
    pSensorChar->setValue(sensorBuffer, 6);
    pSensorChar->notify();
    lastReadTime = millis();
    lastBleNotifyTime = millis();
  }

  if (!deviceConnected && oldDeviceConnected) {
    oldDeviceConnected = deviceConnected;
    Serial.println("[BLE] ✗ 客户端断开事件");
    delay(500);
    BLEDevice::startAdvertising();
    Serial.println("[BLE] 广播已恢复");
  }
#endif

  // ── 定时读取传感器 ──
  // 根据系统状态选择不同的检测间隔
  unsigned long interval;
  if (manualOverride) {
    interval = WATERING_INTERVAL_MS;  // 手动模式下 200ms 高频检测
  } else if (systemState == STATE_WATERING) {
    interval = WATERING_INTERVAL_MS;  // 灌溉态：200ms 高频检测
  } else {
    interval = IDLE_INTERVAL_MS;  // 空闲态：2s 低频检测
  }

  if (now - lastReadTime >= interval) {
    lastReadTime = now;

    readSensors();  // 读取传感器

    // 仅在非手动模式下执行自动灌溉逻辑
    if (!manualOverride) {
      checkWatering();
    }

    // ── 通过串口推送传感器数据 ──
    sendSensorDataSerial();
  }

  // ── BLE 通知推送（独立定时器，0.5 秒间隔） ──
#ifndef NO_BLE
  if (deviceConnected && (now - lastBleNotifyTime >= BLE_NOTIFY_INTERVAL_MS)) {
    lastBleNotifyTime = now;
    uint8_t sensorBuffer[6];
    serializeSensorData(sensorBuffer);
    pSensorChar->setValue(sensorBuffer, 6);
    pSensorChar->notify();
  }
#endif
}
